title: Microsoft Defender Realtime Monitoring Disabled

id: d5f4b7c8-1e2a-4f11-a321-abcdef123465

status: experimental

description: Detects modification of the Microsoft Defender DisableRealtimeMonitoring registry value.

references:
  - https://attack.mitre.org/techniques/T1562/001/

author: Apurv Deoghare

date: 2026-06-18

logsource:
  product: windows
  category: registry_set

detection:
  selection:
    TargetObject|contains:
      - '\Windows Defender\Real-Time Protection\DisableRealtimeMonitoring'

  condition: selection

fields:
  - TargetObject
  - Details
  - Image
  - User

falsepositives:
  - Authorized security administration
  - Security testing
  - Lab environments

level: high

tags:
  - attack.defense-evasion
  - attack.t1562.001
